{
  "grades": {
    "K": {
      "name": "Kindergarten",
      "domains": {
        "CC": {
          "code": "K.CC",
          "name": "Counting & Cardinality",
          "fullName": "Counting & Cardinality",
          "text": "In Kindergarten, Counting & Cardinality focuses on helping students develop fundamental number sense by learning to count, recognize numerals, and understand the relationship between numbers and quantities. Students master counting sequences, connect counting to cardinality (understanding that the last number said represents the total), and begin comparing quantities. This domain establishes the critical foundation for all future mathematical learning by ensuring students understand what numbers represent and how they relate to each other. These skills prepare students for addition and subtraction concepts in first grade.",
          "clusters": {
            "A": {
              "name": "Know number names and the count sequence",
              "text": "Students learn the counting sequence to 100, practice counting forward from various starting points, and connect written numerals with their names and quantities.",
              "standards": {
                "1": {
                  "code": "K.CC.A.1",
                  "name": "Count to 100 by Ones & by Tens",
                  "text": "Count to 100 by ones and by tens."
                },
                "2": {
                  "code": "K.CC.A.2",
                  "name": "Count Forward Beginning with A Given Number",
                  "text": "Count forward beginning from a given number within the known sequence (instead of having to begin at 1)."
                },
                "3": {
                  "code": "K.CC.A.3",
                  "name": "Write & Represent Numbers 0 to 20 with Written Numerals",
                  "text": "Write numbers from 0 to 20. Represent a number of objects with a written numeral 0-20 (with 0 representing a count of no objects)."
                }
              }
            },
            "B": {
              "name": "Count to tell the number of objects",
              "text": "Students develop one-to-one correspondence, understand that counting tells 'how many,' and recognize that the arrangement of objects doesn't affect the total count.",
              "standards": {
                "4": {
                  "code": "K.CC.B.4",
                  "name": "Understand Relationship Between Numbers & Quantities",
                  "text": "Understand the relationship between numbers and quantities; connect counting to cardinality.",
                  "subStandards": {
                    "a": {
                      "code": "K.CC.B.4.a",
                      "name": "Count Objects Using Standard Order",
                      "text": "When counting objects, say the number names in the standard order, pairing each object with one and only one number name and each number name with one and only one object."
                    },
                    "b": {
                      "code": "K.CC.B.4.b",
                      "name": "Count Objects in Different Arrangements",
                      "text": "Understand that the last number name said tells the number of objects counted. The number of objects is the same regardless of their arrangement or the order in which they were counted."
                    },
                    "c": {
                      "code": "K.CC.B.4.c",
                      "name": "Understand Consecutive Numbers Refer to One More",
                      "text": "Understand that each successive number name refers to a quantity that is one larger."
                    }
                  }
                },
                "5": {
                  "code": "K.CC.B.5",
                  "name": "Count Objects in Different Arrangements to Answer \"How Many?\"",
                  "text": "Count to answer \"how many?\" questions about as many as 20 things arranged in a line, a rectangular array, or a circle, or as many as 10 things in a scattered configuration; given a number from 1-20, count out that many objects."
                }
              }
            }
          }
        },
        "OA": {
          "code": "K.OA",
          "name": "Operations & Algebraic Thinking",
          "fullName": "Operations & Algebraic Thinking",
          "text": "In Kindergarten, Operations & Algebraic Thinking introduces students to the foundational concepts of addition and subtraction through concrete representations and problem-solving situations. Students learn to represent mathematical situations using objects, drawings, and eventually symbols, while developing fluency with basic facts within 5. The emphasis on multiple representations helps students understand the meaning behind operations rather than just memorizing procedures. This work prepares students for more formal arithmetic in first grade while building algebraic reasoning skills.",
          "clusters": {
            "A": {
              "name": "Understand addition, and understand subtraction",
              "text": "Students explore addition and subtraction through various representations, solve word problems within 10, and learn to decompose numbers in multiple ways to build number flexibility and fluency within 5.",
              "standards": {
                "1": {
                  "code": "K.OA.A.1",
                  "name": "Represent Addition & Subtraction with Multiple Representations",
                  "text": "Represent addition and subtraction with objects, fingers, mental images, drawings, sounds (e.g., claps), acting out situations, verbal explanations, expressions, or equations."
                },
                "2": {
                  "code": "K.OA.A.2",
                  "name": "Solve Word Problems Involving Adding/Subtracting Within 10 Using Drawings or Objects",
                  "text": "Solve addition and subtraction word problems, and add and subtract within 10, e.g., by using objects or drawings to represent the problem."
                },
                "3": {
                  "code": "K.OA.A.3",
                  "name": "Decompose Numbers Up to 10 in Multiple Ways",
                  "text": "Decompose numbers less than or equal to 10 into pairs in more than one way, e.g., by using objects or drawings, and record each decomposition by a drawing or equation (e.g., 5 = 2 + 3 and 5 = 4 + 1)."
                },
                "4": {
                  "code": "K.OA.A.4",
                  "name": "Use Tools (or Manipulatives) to Make 10 When Given Up to 10",
                  "text": "For any number from 1 to 9, find the number that makes 10 when added to the given number, e.g., by using objects or drawings, and record the answer with a drawing or equation."
                },
                "5": {
                  "code": "K.OA.A.5",
                  "name": "Fluently Add & Subtract Within 5",
                  "text": "Fluently add and subtract within 5."
                }
              }
            }
          }
        }
      }
    },
    "1": {
      "name": "Grade 1",
      "domains": {
        "OA": {
          "code": "1.OA",
          "name": "Operations & Algebraic Thinking",
          "fullName": "Operations & Algebraic Thinking",
          "text": "In Grade 1, Operations & Algebraic Thinking focuses on developing fluency with addition and subtraction within 20 while building students' understanding of the relationship between these operations. Students learn to solve a variety of word problem types, apply properties of operations as problem-solving strategies, and work with equations using symbols for unknown numbers. The domain emphasizes both procedural fluency and conceptual understanding, helping students see patterns and relationships in numbers. This foundation prepares students for multi-digit computation and more complex algebraic reasoning in later grades.",
          "clusters": {
            "A": {
              "name": "Represent and solve problems involving addition and subtraction",
              "text": "Students solve word problems involving various addition and subtraction situations within 20, using objects, drawings, and equations with unknowns in all positions.",
              "standards": {
                "1": {
                  "code": "1.OA.A.1",
                  "name": "Solve Word Problems Involving Adding/Subtracting Within 20",
                  "text": "Use addition and subtraction within 20 to solve word problems involving situations of adding to, taking from, putting together, taking apart, and comparing, with unknowns in all positions, e.g., by using objects, drawings, and equations with a symbol for the unknown number to represent the problem."
                },
                "2": {
                  "code": "1.OA.A.2",
                  "name": "Solve Word Problems Involving Adding Three Whole Numbers With a Sum Up to 20",
                  "text": "Solve word problems that call for addition of three whole numbers whose sum is less than or equal to 20, e.g., by using objects, drawings, and equations with a symbol for the unknown number to represent the problem."
                }
              }
            },
            "B": {
              "name": "Understand and apply properties of operations and the relationship between addition and subtraction",
              "text": "Students learn commutative and associative properties of addition and understand subtraction as finding an unknown addend, building flexibility in computation strategies.",
              "standards": {
                "3": {
                  "code": "1.OA.B.3",
                  "name": "Apply Properties of Operations to Add & Subtract",
                  "text": "Apply properties of operations as strategies to add and subtract. Examples: If 8 + 3 = 11 is known, then 3 + 8 = 11 is also known. (Commutative property of addition.) To add 2 + 6 + 4, the second two numbers can be added to make a ten, so 2 + 6 + 4 = 2 + 10 = 12. (Associative property of addition.)"
                },
                "4": {
                  "code": "1.OA.B.4",
                  "name": "Understand Subtraction as an Unknown-Added Problem",
                  "text": "Understand subtraction as an unknown-addend problem. For example, subtract 10 - 8 by finding the number that makes 10 when added to 8."
                }
              }
            }
          }
        },
        "MD": {
          "code": "1.MD",
          "name": "Measurement & Data",
          "fullName": "Measurement & Data",
          "text": "In Grade 1, Measurement & Data introduces students to comparing and measuring length using non-standard units and organizing information through simple data displays. Students learn to order objects by length, measure using iterating length units, and work with time and money in practical contexts. The domain also introduces students to representing and interpreting data, connecting mathematics to real-world situations. These measurement and data skills provide practical applications of number concepts while preparing students for standard units of measurement and more complex data analysis in later grades.",
          "clusters": {
            "A": {
              "name": "Measure lengths indirectly and by iterating length units",
              "text": "Students order objects by length, measure lengths using non-standard units, and understand that measurement involves covering lengths with no gaps or overlaps.",
              "standards": {
                "1": {
                  "code": "1.MD.A.1",
                  "name": "Order & Compare Objects by Their Length",
                  "text": "Order three objects by length; compare the lengths of two objects indirectly by using a third object."
                },
                "2": {
                  "code": "1.MD.A.2",
                  "name": "Measure Length using Unit Objects",
                  "text": "Express the length of an object as a whole number of length units, by laying multiple copies of a shorter object (the length unit) end to end; understand that the length measurement of an object is the number of same-size length units that span it with no gaps or overlaps."
                }
              }
            }
          }
        }
      }
    },
    "2": {
      "name": "Grade 2",
      "domains": {
        "NBT": {
          "code": "2.NBT",
          "name": "Number & Operations in Base Ten",
          "fullName": "Number & Operations in Base Ten",
          "text": "In Grade 2, Number & Operations in Base Ten deepens students' understanding of place value within 1000 while developing fluency with addition and subtraction within 100. Students learn to read, write, and compare three-digit numbers, understand place value relationships, and use place value strategies for computation. The domain emphasizes mental math strategies and the relationship between place value understanding and computational fluency. This work builds the foundation for multiplication and division with larger numbers in Grade 3.",
          "clusters": {
            "A": {
              "name": "Understand place value",
              "text": "Students understand three-digit numbers in terms of hundreds, tens, and ones, compare numbers using place value understanding, and read and write numbers in various forms.",
              "standards": {
                "1": {
                  "code": "2.NBT.A.1",
                  "name": "Understand Place Value of Each Digit Represented in Hundreds",
                  "text": "Understand that the three digits of a three-digit number represent amounts of hundreds, tens, and ones; e.g., 706 equals 7 hundreds, 0 tens, and 6 ones."
                }
              }
            }
          }
        }
      }
    },
    "3": {
      "name": "Grade 3",
      "domains": {
        "NF": {
          "code": "3.NF",
          "name": "Number & Operations—Fractions",
          "fullName": "Number & Operations—Fractions",
          "text": "In Grade 3, Number & Operations—Fractions introduces students to fractions as numbers for the first time, focusing on unit fractions and fractions with numerators of 1. Students develop understanding of fractions as equal parts of a whole, locate fractions on number lines, and compare fractions with the same numerator or denominator. The domain emphasizes conceptual understanding of what fractions represent rather than computational procedures. This foundational work prepares students for fraction arithmetic and more complex fraction concepts in Grades 4 and 5.",
          "clusters": {
            "A": {
              "name": "Develop understanding of fractions as numbers",
              "text": "Students understand fractions as equal parts of a whole, represent fractions on number lines, and recognize equivalent fractions and compare fractions with same numerators or denominators.",
              "standards": {
                "1": {
                  "code": "3.NF.A.1",
                  "name": "Understand a Fraction is Formed by the Quantity of its Parts",
                  "text": "Understand a fraction 1/b as the quantity formed by 1 part when a whole is partitioned into b equal parts; understand a fraction a/b as the quantity formed by a parts of size 1/b."
                }
              }
            }
          }
        }
      }
    },
    "4": {
      "name": "Grade 4",
      "domains": {
        "MD": {
          "code": "4.MD",
          "name": "Measurement & Data",
          "fullName": "Measurement & Data",
          "text": "In Grade 4, Measurement & Data focuses on solving problems involving measurement conversions, understanding angle measurement, and representing and interpreting data in line plots. Students learn relationships between different measurement units, measure angles with protractors, and analyze data that includes fractions. The domain connects measurement concepts to fraction understanding and develops data analysis skills. This work prepares students for more complex measurement problems and statistical concepts in later grades.",
          "clusters": {
            "A": {
              "name": "Solve problems involving measurement and conversion of measurements",
              "text": "Students know relative sizes of measurement units, convert measurements within the same system, and solve word problems involving measurements.",
              "standards": {
                "1": {
                  "code": "4.MD.A.1",
                  "name": "Convert Measurements Within a System & Display in Two-Column Tables",
                  "text": "Know relative sizes of measurement units within one system of units including km, m, cm; kg, g; lb, oz.; l, ml; hr, min, sec."
                }
              }
            }
          }
        }
      }
    },
    "5": {
      "name": "Grade 5",
      "domains": {
        "OA": {
          "code": "5.OA",
          "name": "Operations & Algebraic Thinking",
          "fullName": "Operations & Algebraic Thinking",
          "text": "In Grade 5, Operations & Algebraic Thinking focuses on helping students write and interpret numerical expressions using grouping symbols and analyze patterns and relationships between sequences. Students learn to use parentheses, brackets, and braces to clarify order of operations, write expressions that record calculations, and generate numerical patterns using given rules. By comparing terms in different sequences, graphing ordered pairs, and identifying relationships, students develop algebraic reasoning skills that prepare them for middle school mathematics. This work bridges arithmetic computation with the abstract thinking required for algebra.",
          "clusters": {
            "A": {
              "name": "Write and interpret numerical expressions",
              "text": "Students use grouping symbols to structure calculations and express verbal statements symbolically, reinforcing precision in mathematical communication and order of operations.",
              "standards": {
                "1": {
                  "code": "5.OA.A.1",
                  "name": "Evaluate Expressions Using Groupings",
                  "text": "Use parentheses, brackets, or braces in numerical expressions, and evaluate expressions with these symbols."
                },
                "2": {
                  "code": "5.OA.A.2",
                  "name": "Write & Interpret Simple Expressions",
                  "text": "Write simple expressions that record calculations with numbers, and interpret numerical expressions without evaluating them. For example, express the calculation \"add 8 and 7, then multiply by 2\" as 2 × (8 + 7). Recognize that 3 × (18932 + 921) is three times as large as 18932 + 921, without having to calculate the indicated sum or product."
                }
              }
            },
            "B": {
              "name": "Analyze patterns and relationships",
              "text": "Students generate sequences using different rules, compare corresponding terms, and graph ordered pairs to recognize and explain relationships between patterns.",
              "standards": {
                "3": {
                  "code": "5.OA.B.3",
                  "name": "Generate & Identify Patterns Resulting from Two Given Rules",
                  "text": "Generate two numerical patterns using two given rules. Identify apparent relationships between corresponding terms. Form ordered pairs consisting of corresponding terms from the two patterns, and graph the ordered pairs on a coordinate plane."
                }
              }
            }
          }
        },
        "NBT": {
          "code": "5.NBT",
          "name": "Number & Operations in Base Ten",
          "fullName": "Number & Operations in Base Ten",
          "text": "In Grade 5, Number & Operations in Base Ten extends place value understanding to decimals and focuses on developing fluency with multi-digit whole number and decimal operations. Students learn place value relationships with decimals to thousandths, multiply and divide whole numbers and decimals efficiently, and understand patterns in operations with powers of 10. The domain emphasizes both conceptual understanding and computational fluency while connecting to real-world applications. This work prepares students for ratio and proportion concepts in Grade 6.",
          "clusters": {
            "A": {
              "name": "Understand the place value system",
              "text": "Students recognize place value patterns in multi-digit numbers and decimals, compare and round decimal numbers, and understand relationships between adjacent place values.",
              "standards": {
                "1": {
                  "code": "5.NBT.A.1",
                  "name": "Understand Base Ten Place Value Relationships",
                  "text": "Recognize that in a multi-digit number, a digit in one place represents 10 times as much as it represents in the place to its right and 1/10 of what it represents in the place to its left."
                },
                "2": {
                  "code": "5.NBT.A.2",
                  "name": "Explain Patterns in the Number of Zeros when Multiplying by Powers of 10",
                  "text": "Explain patterns in the number of zeros of the product when multiplying a number by powers of 10, and explain patterns in the placement of the decimal point when a decimal is multiplied or divided by a power of 10. Use whole-number exponents to denote powers of 10."
                },
                "3": {
                  "code": "5.NBT.A.3",
                  "name": "Read & Write Decimals to Thousandths",
                  "text": "Read, write, and compare decimals to thousandths.",
                  "subStandards": {
                    "a": {
                      "code": "5.NBT.A.3.a",
                      "name": "Read & Write Decimals to Thousandths",
                      "text": "Read and write decimals to thousandths using base-ten numerals, number names, and expanded form, e.g., 347.392 = 3 × 100 + 4 × 10 + 7 × 1 + 3 × (1/10) + 9 × (1/100) + 2 × (1/1000)."
                    },
                    "b": {
                      "code": "5.NBT.A.3.b",
                      "name": "Compare Decimals to Thousandths",
                      "text": "Compare two decimals to thousandths based on meanings of the digits in each place, using >, =, and < symbols to record the results of comparisons."
                    }
                  }
                },
                "4": {
                  "code": "5.NBT.A.4",
                  "name": "Use Place Value to Round Decimals",
                  "text": "Use place value understanding to round decimals to any place."
                }
              }
            },
            "B": {
              "name": "Perform operations with multi-digit whole numbers and with decimals to hundredths",
              "text": "Students fluently multiply multi-digit whole numbers, divide with two-digit divisors, and perform all four operations with decimals.",
              "standards": {
                "5": {
                  "code": "5.NBT.B.5",
                  "name": "Multiply Multi-Digit Whole Numbers Using the Standard Algorithm",
                  "text": "Fluently multiply multi-digit whole numbers using the standard algorithm."
                },
                "6": {
                  "code": "5.NBT.B.6",
                  "name": "Divide Whole Numbers (Up to 4-Digit Dividends & 2-Digit Divisors)",
                  "text": "Find whole-number quotients of whole numbers with up to four-digit dividends and two-digit divisors, using strategies based on place value, the properties of operations, and/or the relationship between multiplication and division. Illustrate and explain the calculation by using equations, rectangular arrays, and/or area models."
                },
                "7": {
                  "code": "5.NBT.B.7",
                  "name": "Add, Subtract, Multiply, and Divide Decimals to Hundredths",
                  "text": "Add, subtract, multiply, and divide decimals to hundredths, using concrete models or drawings and strategies based on place value, properties of operations, and/or the relationship between addition and subtraction; relate the strategy to a written method and explain the reasoning used."
                }
              }
            }
          }
        }
      }
    },
    "6": {
      "name": "Grade 6",
      "domains": {
        "RP": {
          "code": "6.RP",
          "name": "Ratios & Proportional Relationships",
          "fullName": "Ratios & Proportional Relationships",
          "text": "In Grade 6, Ratios & Proportional Relationships introduces students to proportional reasoning, one of the most important mathematical concepts for future success in algebra and advanced mathematics. Students learn to understand and express ratio relationships, work with unit rates and equivalent ratios, and solve problems involving proportional relationships. The domain emphasizes multiple representations of proportional relationships including tables, graphs, and equations. This foundational work in proportional reasoning prepares students for linear functions, similarity, and percentage applications in later grades.",
          "clusters": {
            "A": {
              "name": "Understand ratio concepts and use ratio reasoning to solve problems",
              "text": "Students understand ratio relationships, find equivalent ratios, use ratios to solve unit rate problems, and apply proportional reasoning to solve real-world problems including percentages.",
              "standards": {
                "1": {
                  "code": "6.RP.A.1",
                  "name": "Understand & Describe Ratios",
                  "text": "Understand the concept of a ratio and use ratio language to describe a ratio relationship between two quantities."
                }
              }
            }
          }
        }
      }
    },
    "7": {
      "name": "Grade 7",
      "domains": {
        "EE": {
          "code": "7.EE",
          "name": "Expressions & Equations",
          "fullName": "Expressions & Equations",
          "text": "In Grade 7, Expressions & Equations extends algebraic reasoning to include multi-step equations and inequalities while introducing linear equation concepts. Students learn to use properties of operations to generate equivalent expressions, solve multi-step problems involving linear equations, and work with inequalities in real-world contexts. The domain emphasizes algebraic manipulation skills and mathematical modeling with linear relationships. This algebraic foundation prepares students for systems of equations and functions in Grade 8.",
          "clusters": {
            "A": {
              "name": "Use properties of operations to generate equivalent expressions",
              "text": "Students apply properties of operations and factoring to rewrite algebraic expressions and solve problems involving linear expressions.",
              "standards": {
                "1": {
                  "code": "7.EE.A.1",
                  "name": "Apply Properties of Operations to Create Equivalent Expressions",
                  "text": "Apply properties of operations as strategies to add, subtract, factor, and expand linear expressions with rational coefficients."
                }
              }
            }
          }
        }
      }
    },
    "8": {
      "name": "Grade 8",
      "domains": {
        "F": {
          "code": "8.F",
          "name": "Functions",
          "fullName": "Functions",
          "text": "In Grade 8, Functions introduces students to the concept of a function as a mathematical relationship where each input has exactly one output, laying the foundation for high school mathematics. Students learn to identify functions from tables, graphs, and equations, compare linear and nonlinear functions, and understand how functions model real-world relationships. The domain emphasizes multiple representations of functions and their applications to problem-solving. This function concept work provides essential preparation for high school algebra, geometry, and advanced mathematics courses.",
          "clusters": {
            "A": {
              "name": "Define, evaluate, and compare functions",
              "text": "Students understand the definition of a function, identify functions using various representations, and compare properties of different functions including linear and nonlinear relationships.",
              "standards": {
                "1": {
                  "code": "8.F.A.1",
                  "name": "Understand Definition of a Function",
                  "text": "Understand that a function is a rule that assigns to each input exactly one output. The graph of a function is the set of ordered pairs consisting of an input and the corresponding output."
                }
              }
            }
          }
        }
      }
    }
  }
}